{
  "self": "Bootstrap is a free and open-source front-end framework for designing responsive and mobile-first web pages. It is one of the most popular frameworks for building responsive web designs and offers a wide range of pre-designed UI components, such as forms, buttons, navigation bars, and more. Bootstrap is built with CSS and JavaScript and is based on a 12-column grid system, which allows for easy layout and alignment of elements on a web page.`\n\nBootstrap also provides a set of CSS classes and JavaScript plugins that can be used to quickly add functionality such as modals, carousels, and tooltips to a website. Additionally, it is compatible with all modern web browsers and can be used with any web development framework or back-end language.\n\nBootstrap is a popular choice for quickly building responsive, mobile-friendly websites, and web applications. It is easy to use and customize, and it saves a lot of time for developers who don't want to create everything from scratch.",
  "class": {
    "definition:def": "En utilisant Bootstrap, une classe est un nom donné à une règle CSS qui peut être appliquée à des éléments HTML pour les styliser de différentes manières. Les classes Bootstrap prédéfinies peuvent être utilisées pour ajouter des styles de mise en page, de typographie et d'autres styles visuels à vos pages web.",
    "use:utiliser": "Pour utiliser une classe Bootstrap, vous devez d'abord inclure les fichiers CSS et JavaScript de Bootstrap dans votre projet. Ensuite, vous pouvez appliquer les classes Bootstrap en utilisant la propriété 'class' dans vos balises HTML. Par exemple, pour ajouter une bordure rouge à une image, vous pourriez utiliser la classe 'border-danger' comme ceci : &lt;img class='border-danger' src='image.jpg'> Exemple : <pre><code class=language-markup>&lt;button class='btn btn-primary'>Envoyer&lt;/button></code></pre>"
  },
  "composent:compo": {
    "definition:def": "Dans Bootstrap, un composant est un élément de base de l'interface utilisateur qui peut être utilisé pour créer des pages web. Les composants Bootstrap incluent des choses comme des boutons, des formulaires, des tables, des navbars, des carousels, etc. Exemple : <pre><code class=language-markup>&lt;div class='alert alert-success' role='alert'> Formulaire soumis avec succès ! &lt;/div>&lt;/code></pre>"
  },
  "navbar:nav": {
    "definition:def": "Une navbar ou barre de navigation est un élément commun de l'interface utilisateur qui permet aux utilisateurs de naviguer à travers les différentes sections d'un site web. Dans Bootstrap, les navbars sont créées à l'aide d'une combinaison de balises HTML et de classes CSS prédéfinies.",
    "use:utiliser": "Pour utiliser une navbar Bootstrap, vous devez inclure les fichiers CSS et JavaScript de Bootstrap dans votre projet, puis utiliser les balises HTML et les classes CSS prédéfinies pour créer la structure de votre navbar. Vous pouvez également personnaliser l'apparence de la navbar en utilisant des classes CSS supplémentaires. Exemple : <pre><code class=language-markup>&lt;nav class='navbar navbar-expand-lg navbar-light bg-light'> &lt;a class='navbar-brand' href='#'>Mon site&lt;/a> &lt;button class='navbar-toggler' type='button' data-toggle='collapse' data-target='#navbarNav' aria-controls='navbarNav' aria-expanded='false' aria-label='Toggle navigation'> &lt;span class='navbar-toggler-icon'>&lt;/span> &lt;/button> &lt;div class='collapse navbar-collapse' id='navbarNav'> &lt;ul class='navbar-nav'> &lt;li class='nav-item'> &lt;a class='nav-link' href='#'>Accueil&lt;/a> &lt;/li> &lt;li class='nav-item'> &lt;a class='nav-link' href='#'>À propos&lt;/a> &lt;/li> &lt;li class='nav-item'> &lt;a class='nav-link' href='#'>Contact&lt;/a> &lt;/li> &lt;/ul> &lt;/div> &lt;/nav></code></pre>"
  },
  "carousel": {
    "definition:def": "Un carousel ou diaporama est un élément de l'interface utilisateur qui permet de naviguer entre plusieurs images ou contenus de manière automatique ou manuelle. Dans Bootstrap, les carousels sont créés en utilisant une combinaison de balises HTML, de JavaScript et de classes CSS prédéfinies.",
    "use:utiliser": "Pour utiliser un carousel Bootstrap, vous devez inclure les fichiers CSS et JavaScript de Bootstrap dans votre projet, puis utiliser les balises HTML et les classes CSS prédéfinies pour créer la structure de votre carousel. Vous pouvez également personnaliser l'apparence et le comportement du carousel en utilisant des options de configuration JavaScript et des classes CSS supplémentaires. Il est important de noter que pour utiliser le carousel Bootstrap, vous avez également besoin de inclure jQuery dans votre projet car il utilise des fonctionnalités de jQuery pour fonctionner. Exemple : <pre><code class=language-markup>&lt;div id='carouselExampleIndicators' class='carousel slide' data-ride='carousel'> &lt;ol class='carousel-indicators'> &lt;li data-target='#carouselExampleIndicators' data-slide-to='0' class='active'>&lt;/li> &lt;li data-target='#carouselExampleIndicators' data-slide-to='1'>&lt;/li> &lt;li data-target='#carouselExampleIndicators' data-slide-to='2'>&lt;/li> &lt;/ol> &lt;div class='carousel-inner'> &lt;div class='carousel-item active'> &lt;img class='d-block w-100' src='...' alt='First slide'> &lt;/div> &lt;div class='carousel-item'> &lt;img class='d-block w-100' src='...' alt='Second slide'> &lt;/div> &lt;div class='carousel-item'> &lt;img class='d-block w-100' src='...' alt='Third slide'> &lt;/div> &lt;/div> &lt;a class='carousel-control-prev' href='#carouselExampleIndicators' role='button' data-slide='prev'> &lt;span class='carousel-control-prev-icon' aria-hidden='true'>&lt;/span> &lt;span class='sr-only'>Précédent&lt;/span> &lt;/a> &lt;a class='carousel-control-next' href='#carouselExampleIndicators' role='button' data-slide='next'> &lt;span class='carousel-control-next-icon' aria-hidden='true'>&lt;/span> &lt;span class='sr-only'>Suivant&lt;/span> &lt;/a> &lt;/div></code></pre>"
  },
  "couleur:couleurs:color:colors": {
    "use:utiliser": "Dans Bootstrap, les couleurs sont utilisées pour styliser les éléments de l'interface utilisateur, comme les boutons, les textes, les bordures, etc. Il existe des classes prédéfinies pour les couleurs de base telles que les couleurs de succès, d'avertissement, de danger, etc. ",
    "liste:list": "Les couleurs prédéfinies de Bootstrap sont: primary, secondary, success, danger, warning, info, light, dark, white, transparent."
  }
}
